Revit 2026 API

# FlowConvergenceCharacteristic Enumeration

---

The flow convergence characteristic of the analytical segment cluster.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FlowConvergenceCharacteristic
```
```vb
Public Enumeration FlowConvergenceCharacteristic
```
```cpp
public enum class FlowConvergenceCharacteristic
```
```fsharp
type FlowConvergenceCharacteristic
```

| Member name | Value | Description |
| --- | --- | --- |
| Converge | 1 | Multile flow paths are converged into one segment. |
| Diverge | 2 | The flow is diverged from one segment into multiple paths. |
| Undefined | 0 | The flow convergence characteristic is undefined. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace